Revit 2024 API
ElementRecord.IsAnElementType Method
 Identifies if the element record represents an ElementType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public bool IsAnElementType()
Visual Basic
Public Function IsAnElementType As Boolean
Visual C++
public:
bool IsAnElementType()
Return Value
 True if the element record represents an ElementType.
See Also
ElementRecord Class
Autodesk.Revit.DB Namespace